# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'aws/tap'
tap "1password/tap"
tap "ktr0731/evans"
tap "hashicorp/tap"

# System tools
brew 'gettext'
brew 'coreutils'
brew 'pstree'
brew 'findutils'
brew 'htop'
brew 'gnupg'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnu-sed'
brew 'grep'
brew 'less'
brew 'tree'
brew 'screen'
brew 'shfmt'
brew 'jump'
brew 'exa'

# Util
brew 'pngquant'
brew 'zopfli'

# Development & Tools
cask 'ghostty'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
brew 'neovim'
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'bat'
brew 'colordiff'
brew 'pinentry-mac'
brew 'diff-so-fancy'
brew 'git'
brew 'git-delta'
brew 'git-crypt'
brew 'git-interactive-rebase-tool'
brew 'git-lfs'
brwe 'hub'
brew 'ripgrep'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'fzf'
brew 'jq'
brew 'rust'
brew 'pyenv'
brew 'virtualenv'
brew 'protobuf'
brew 'grpc'
brew 'direnv'
brew 'watch'
brew 'universal-ctags'
brew 'curl'
brew 'shellcheck'
brew 'tmux'
brew 'gh'
brew 'curl'
brew 'wget'
brew 'editorconfig'
cask 'postman'
brew 'evans'
brew 'asdf'
brew 'syncthing'
brew 'maven'
cask 'postico'
cask 'corretto'

# Cloud
brew 'aws-sam-cli'
brew 'awscli'
brew 'aws-vault'
cask 'google-cloud-sdk'
brew 'helm'
brew 'fluxctl'
brew 'cfn-lint'
brew 'hashicorp/tap/terraform'

# Container
brew 'kubectx'
brew 'kind'
cask 'docker'
brew 'docker-compose'
brew 'krew'

# Tooling
brew 'aria2'
brew 'rclone'
brew 'youtube-dl'

# Desktop
cask 'zoom'
cask 'slack'
cask 'rectangle'
cask 'monitorcontrol'
cask 'spotify'
cask 'google-chrome'
cask 'open-in-code'
cask 'discord'
cask 'iina'
cask 'beyond-compare'
cask '1password-cli'
cask 'beyond-compare'
cask 'anki'
cask 'karabiner-elements'
cask 'obsidian'
cask 'raycast'
cask 'font-hack-nerd-font'
cask 'openvpn-connect'
cask 'whatsapp'
cask 'telegram'
cask 'yacreader'
cask 'skype'
cask 'todoist'
cask 'shottr'
cask 'google-drive'
