# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'aws/tap'

# System tools
brew 'gettext'
brew 'coreutils'
brew 'pstree'
brew 'findutils'
brew 'htop'
brew 'gnupg'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnu-sed'
brew 'grep'
brew 'less'
brew 'tree'
brew 'screen'
brew 'shfmt'
brew 'jump'

# Util
brew 'pngquant'
brew 'zopfli'

# Development & Tools
cask 'goland'
cask 'visual-studio-code'
cask 'neovim'
cask 'alacritty'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'bat'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git'
brew 'git-delta'
brew 'ripgrep'
brew 'interactive-rebase-tool'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'fzf'
brew 'jq'
brew 'node'
brew 'go'
brew 'rust'
brew 'python3'
brew 'protobuf'
brew 'grpc'
brew 'direnv'
brew 'watch'
brew 'universal-ctags'
brew 'curl'
brew 'shellcheck'
brew 'tmux'
brew 'curl'
brew 'wget'
brew 'editorconfig'

# Cloud
brew 'aws-sam-cli'
brew 'awscli'
brew 'aws-vault'
cask 'google-cloud-sdk'

# Container
brew 'kubectx'
brew 'rancher'
brew 'kind'
brew 'kube-ps1'

# Tooling
brew 'aria2'
brew 'rclone'
brew 'youtube-dl'

# Desktop
cask 'maccy'
cask 'zoomus'
cask 'slack'
cask 'rectangle'
cask 'monitorcontrol'
cask 'spotify'
cask '1password'
cask 'google-chrome'
cask 'open-in-code'
cask 'discord'
cask 'iina'
cask 'beyond-compare'
cask 'anki'
cask 'karabiner-elements'
cask '1password'
cask 'obsidian'
cask "font-hack-nerd-font"
